import React from 'react'

const services = [
  {
    num: '01',
    img: '/assets/servis/front1.jpg',
     slug: 'front-end',
    title: 'Course Front-End',
    description: `أهلاً بيك في أول خطوة حقيقية هتفتحلك باب لعالم جديد. 

مفيش ضغط، مفيش استعجال، بس في محتوى هيعلّمك، ويوصلّك.

هتتعلم الـ Front-End بأسلوب بسيط، وتفهم كل حاجة من غير تعقيد.
`,
    skilis: [
'🎯المرحلة الأولى',
'▫HTML',
'▫CSS',
'▫JavaScript ',
'🎯 المرحلة الثانية ',
'▫Bootstrap',
'▫Tailwind CSS',
'▫SASS',
'🎯 المرحلة الثالثة',
'▫React.js',
'▫Next.js',
'▫TypeScript',
'🎯المهارات العملية',
'▫Problem Solving',
'▫Hosting & Domain',
'▫GitHub',
'🎯 هدايا الكورس',
'▫ Freelancing  كورس مجاني',
'▫  CV مراجعة مجانية',
'▫ اساله الإنترفيو ',
'▫ تدريب عملي على الإنترفيو',
'▫  LinkedIn تحسين',
'▫ Portfolio بناء '
]
  },
  {
    num: '02',
    img: '/assets/servis/b1.jpg',
     slug: 'back-end',
    title: 'Course Back-End',
    description: `أهلاً بيك في أول خطوة هتفتحلك باب لعالم جديد، عالم بيشتغل كله من ورا الكواليس.

      ببساطة خطوة بخطوة.. هتفهم، تطبّق، وتشوف شغلك بيكبر قدامك.

      الـ Back-End ممكن يبان صعب، بس معانا هتكتشف إنه أسهل مما تتخيل.

      `,
    skilis: [
      '🎯المرحلة الأولى',
      'JavaScript Basics',
      '▫Node.js',
      '🎯 المرحلة التايه: المهارات العملية',
      '▫Express.js',
      '▫MongoDB Compass',
      '▫Postman',
      '🎯 المرحلة التالتة: المهارات العملية',
      '▫Proplem solving ',
      '▫GitHub',
      '▫Hosting & Domain'
    ]
  },
  {
    num: '03',
    img: '/assets/servis/mobileApp.jpg',
    slug: 'mobile-app',
    title: 'Course Moblie Application',
    description: `تفاصيل كورس Mobile Application 🫶
      أهلاً بيك في رحلة هتتعلم فيها إزاي تصمّم وتبرمج تطبيق كامل يشتغل على Android و iOS بكود واحد بس.
      من غير تعقيد`,
    skilis: [
      '▫ Dart Basics',
      '▫ OOP (Object Oriented Programming)',
      '▫ Flutter Basics',
      '▫ Widgets & Navigation',
      '▫ State Management (Cubit)',
      '▫ APIs + Dio',
      '▫ Local Storage',
      '▫ Firebase Basics',
      '▫ Problem Solving',
      '▫ GitHub',
      'الكورس مش بيقف عند الشرح بس، إحنا مكملين معاك بعد ما تتعلّم',
      '▫ Freelancing  كورس مجاني',
      '▫  CV مراجعة مجانية',
      '▫ اساله الإنترفيو ',
      '▫ تدريب عملي على الإنترفيو',
      '▫  LinkedIn تحسين',
      '▫ Portfolio بناء '
    ]
  },
  {
    num: '04',
    img: '/assets/servis/fullstack.png',
    title: 'Full Stack Development',
    slug: 'full-stack',
    description:`أهلاً بيك في تجربة هتعلّمك تبني موقع كامل بإيدك، من البداية للنهاية، بدون استعجال ولا تعقيد بطريقة سهلة ومنظمة. `,
    skilis: [
      '🎯المرحلة الأولى',
      '▫HTML',
      '▫CSS',
      '▫JavaScript ',
      '🎯 المرحلة الثانية ',
      '▫Bootstrap',
      '▫Tailwind CSS',
      '▫SASS',
      '🎯 المرحلة الثالثة',
      '▫React.js',
      '▫Next.js',
      '▫TypeScript',
      '🎯المرحلة الأولى',
      'JavaScript Basics',
      '▫Node.js',
      '🎯 المرحلة التايه: المهارات العملية',
      '▫Express.js',
      '▫MongoDB Compass',
      '▫Postman',
      '🎯المهارات العملية',
      '▫Problem Solving',
      '▫Hosting & Domain',
      '▫GitHub',
      '🎯 هدايا الكورس',
      '▫ Freelancing  كورس مجاني',
      '▫  CV مراجعة مجانية',
      '▫ اساله الإنترفيو ',
      '▫ تدريب عملي على الإنترفيو',
      '▫  LinkedIn تحسين',
      '▫ Portfolio بناء ',
    ]
  },
  {
    num: '05',
    img: '/assets/servis/MEN.jpg',
    slug: 'mentorship',
    title: 'Mentorship Service',
    description: `   
        أهلاً بيك في رحلة جديدة وبداية مختلفة، مش هتكون لوحدك فيها.
        وأنت ماشي لوحدك.. طبيعي تتوه، تتعب، أو حتى تفكر تبطّل.
        بس لما يكون معاك حد فاهم الطريق، ومجرّبه، وعايز يشوفك ناجح ومحقق حلمك، ساعتها الحكاية بتختلف.
        وده هدف خدمة المنتور، وده دورها بالتفصيل`,
    skilis: [
      '🎯 المنتور بيساعدك في أي؟',

      '▫ تحدد هدفك وتختار الطريق المناسب ليك.',

      '▫ تشتغل على تاسكات عملية، وتاخد Feedback مباشر تطور بيه مستواك.',

      '▫تشتغل على مشاريع حقيقية تساعدك تبني Portfolio قوي. ',

      '▫ تتعلم من أخطائك وتفهمها بدل ما تضيع وقتك في التوهان.',

      '▫ تعرف نقاط ضعفك وتشتغل عليها، وتقوي نقاط قوتك ومهاراتك بشكل حقيقي.',

      '▫ تشوف شغلك بنظرة مختلفة وتطوره باستمرار.',

      '▫ تاخد نصايح عملية ومهنية تقدر تطبقها فورًا.',

      '🎯 الخدمة دي معمولة مخصوص لـ:',

      '✅ اللي بدأ يتعلم برمجة وحاسس إنه تايه ومحتاج حد يوجهه.',

      '✅ اللي خلّص كورسات ومش عارف يبدأ يطبّق أو يشتغل.',

      '✅ اللي بيشتغل على مشروع وعايز حد يراجعه معاه خطوة بخطوة.',

      '✅ اللي عايز يبني بورتفوليو حقيقي يثبت بيه شغله.',

      '✅ اللي عايز دعم حقيقي، ومش عايز يتعلم لوحده من فيديوهات.',
    ]

},
  {
    num: '06',
    img: '/assets/servis/mobileApp.jpg',
    slug: 'programming-grant',
    title: 'Programming grant',
    description: 'منحه البرمجه الشامله',
    skilis: [
      '🎯 منحه البرمجه الشامله',
      'Front-End',
      'Back-End',
      'Full-Stack',
      'Moblie Application',
    ]
  },
  {
    num: '07',
    img: '/assets/servis/mobileApp.jpg',
    slug: 'training-service',
    title: 'Training Service',
    description: 'لو أنت خريج حاسبات أو مخلص كورس برمجة، إحنا بنقدملك تدريب مجاني لمدة 3 شهور تطبق فيه اللي اتعلمته وتكسب خبرة تؤهلك لسوق العمل',
    skilis: [
      '▫ هتدرب على مشاريع حقيقية',
      'منصه تعليميه',
      'e-commerce',
      'social media apps'
    ]
  }
  
];

const page = ({ params }) => {
const service = services.find((item) => item.slug === params.serviceID);

  if (!service) return <h1 className="text-center p-20 text-2xl">الخدمة غير موجودة ❌</h1>;
  return (
    <div className="p-6 md:p-10 flex flex-col md:flex-row gap-6 items-center md:items-start">
        <img src={service.img} alt={service.title} className="w-full md:w-[400px] rounded-xl object-cover h-auto" />
        <div className='text-right flex flex-col gap-6 max-w-xl'>
            <h1 className="text-2xl md:text-4xl font-bold">{service.title}</h1>
            <p className="text-md md:text-lg leading-relaxed text-gray-700 whitespace-pre-line">{service.description}</p>
             <ul className="list-none space-y-2 pl-0 text-gray-700 leading-relaxed text-right">
              {service.skilis.map((skill, index) => (
              <li key={index}>{skill}</li>
            ))}
          </ul>
        </div>
    </div>
  )
}

export default page
